Repository: CofficLab/Lumi
Catalog: Plugins/ToolManagerPlugin/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Arguments
zh_hans: 参数
zh_hk: 參數

source: Choose a record from the list to inspect its arguments and result.
zh_hans: 从列表中选择一条记录以查看参数和结果。
zh_hk: 從列表中選擇一筆記錄以查看參數與結果。

source: Decoding…
zh_hans: 正在解码…
zh_hk: 正在解碼…

source: Description
zh_hans: 描述
zh_hk: 描述

source: Duration
zh_hans: 耗时
zh_hk: 耗時

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Execution Log
zh_hans: 执行日志
zh_hk: 執行日誌

source: Execution Log unavailable
zh_hans: 执行日志不可用
zh_hk: 執行日誌不可用

source: Failed
zh_hans: 失败
zh_hk: 失敗

source: Failure details returned by the tool
zh_hans: 工具返回的失败详情
zh_hk: 工具回傳的失敗詳情

source: Invocation
zh_hans: 调用信息
zh_hk: 呼叫資訊

source: JSON payload decoded from the model
zh_hans: 由模型解码出的 JSON 参数
zh_hk: 由模型解碼出的 JSON 參數

source: Lumi storage is not configured, so tool call records cannot be persisted.
zh_hans: Lumi 存储未配置,无法持久化工具调用记录。
zh_hk: Lumi 儲存未設定,無法持久化工具呼叫記錄。

source: No tool calls
zh_hans: 暂无工具调用
zh_hk: 暫無工具呼叫

source: OK
zh_hans: 成功
zh_hk: 成功

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理

source: Result
zh_hans: 结果
zh_hk: 結果

source: Risk Level
zh_hans: 风险等级
zh_hk: 風險等級

source: Select a tool call
zh_hans: 选择一条工具调用
zh_hk: 選擇一筆工具呼叫

source: Started At
zh_hans: 开始时间
zh_hk: 開始時間

source: Status
zh_hans: 状态
zh_hk: 狀態

source: Succeeded
zh_hans: 成功
zh_hk: 成功

source: Tool
zh_hans: 工具
zh_hk: 工具

source: Tool Core
zh_hans: 核心工具
zh_hk: 核心工具

source: Tool executions recorded by Lumi will appear here.
zh_hans: Lumi 记录的工具调用将显示在这里。
zh_hk: Lumi 記錄的工具呼叫將顯示在這裡。

source: Tool identity, timing and outcome
zh_hans: 工具标识、耗时与执行结果
zh_hk: 工具識別、耗時與執行結果

source: Tool output returned to the agent loop
zh_hans: 返回到 Agent 循环的工具输出
zh_hk: 回傳至 Agent 迴圈的工具輸出

source: ToolManager Plugin
zh_hans: 工具管理器
zh_hk: 工具管理器

source: Tools
zh_hans: 工具
zh_hk: 工具

source: tool calls
zh_hans: 条工具调用
zh_hk: 筆工具呼叫

# 提供 Lumi 的基础工具（文件/命令）。
source: Provides Lumi's core tools (file/command).
zh_hans: 提供 Lumi 的基础工具（文件/命令）。
zh_hk: 提供 Lumi 的基礎工具（文件/命令）。
